{
  "architectures": [
    "RustNNGPT"
  ],
  "hidden_size": 64,
  "load_balance_weight": 0.01,
  "max_position_embeddings": 128,
  "mla_compression": 0.5,
  "model_type": "rust_nn_gpt",
  "num_attention_heads": 4,
  "num_experts": 8,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 8,
  "num_key_value_heads": 1,
  "use_load_balancing": true,
  "vocab_size": 50257
}